IDEA Open Model
ReinfAroundOpening.DiagonalEndsType Property
Compatible with IDEA StatiCa v 10.1
 End type of diagonal reinforcement bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public LongReinfEndType DiagonalEndsType { get; set; }
Public Property DiagonalEndsType As LongReinfEndType
	Get
	Set
public:
property LongReinfEndType DiagonalEndsType {
	LongReinfEndType get ();
	void set (LongReinfEndType value);
}
Property Value
Type: LongReinfEndType
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace